app/Controllers/Leafletdraw.php

    public function delete_point($id){
        $this->TbldatapointModel->delete($id);
---
DELETE FROM "tbl_data_point"
WHERE "id" IN ('2')

    public function delete_polygon($id){
        $this->TbldatapolygonModel->delete($id);
---
DELETE FROM "tbl_data_polygon"
WHERE "id" IN ('5')